Revit 2027 API
SchemaBuilder.VendorIdIsValid Method
 Checks whether the given vendor ID string is valid. A valid vendor ID string: 1. Has a length of at least 4 characters and no more than 253 characters, and 2. Contains only letters, digits, or any of the following special characters: ! " # & \ ( ) + , . - : ; < = > ? _ ` | ~
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool VendorIdIsValid(
	string vendorId
)
Public Shared Function VendorIdIsValid (
	vendorId As String
) As Boolean
public:
static bool VendorIdIsValid(
	String^ vendorId
)
static member VendorIdIsValid :
        vendorId : string -> bool
Parameters
vendorId String
 The vendor ID to check.
Return Value
Boolean
 True if the vendor ID is valid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace